InformationRegisters/ИА_УровниДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_УровниДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ПодписиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ПодписиСотрудников</Name>
			<Comment>Образцы подписей сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДоступныеИнструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДоступныеИнструкции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_РедакторИнструкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_РедакторИнструкций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Word</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Writer</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИА_ЗаданиеНаИзучениеДИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗаданиеНаИзучениеДИ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_ИзучениеДИ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструкция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изучено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДстроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДстроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ИА_Определения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Определения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Определение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склонения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Слово</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_ОбщиеПроцедуры_Технология_Сервер/Ext/Module.bsl
Функция ПолучитьСсылкуСправочника(ИмяСправочника, UUID) Экспорт
	
	Возврат Справочники[ИмяСправочника].ПолучитьСсылку(UUID); 
	
КонецФункции


Функция ОпределениеПоСлову(Слово) Экспорт
	
	ЗапросСлова = Новый Запрос;
	ЗапросСлова.Текст = "ВЫБРАТЬ
	|	ИА_ОпределенияСклонения.Ссылка.Определение КАК Определение
	|ИЗ
	|	Справочник.ИА_Определения.Склонения КАК ИА_ОпределенияСклонения
	|ГДЕ
	|	ИА_ОпределенияСклонения.Слово ПОДОБНО &Слово";
	ЗапросСлова.УстановитьПараметр("Слово",Слово);
	Выборка= ЗапросСлова.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Определение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция СсылкаПоСлову(Слово) Экспорт
	
	ЗапросСлова = Новый Запрос;
	ЗапросСлова.Текст = "ВЫБРАТЬ
	|	ИА_ОпределенияСклонения.Ссылка
	|ИЗ
	|	Справочник.ИА_Определения.Склонения КАК ИА_ОпределенияСклонения
	|ГДЕ
	|	ИА_ОпределенияСклонения.Слово ПОДОБНО &Слово";
	ЗапросСлова.УстановитьПараметр("Слово",Слово);
	Выборка= ЗапросСлова.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ИА_ВычислитьПеременную(объект,переменная,формула = "") Экспорт
	Если СОКРЛП(формула)= "" И СОКРЛП(переменная)<>"" Тогда
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_ПеременныеИнструкцийПеременные.Формула
		|ИЗ
		|	Справочник.ИА_ПеременныеИнструкций.Переменные КАК ИА_ПеременныеИнструкцийПеременные
		|ГДЕ
		|	ИА_ПеременныеИнструкцийПеременные.Переменная = &Переменная
		|	И ИА_ПеременныеИнструкцийПеременные.Ссылка.ПометкаУдаления = Ложь ";
		Запрос.УстановитьПараметр("Переменная",переменная);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			формула = Выборка.Формула;
		КонецЕсли;
	КонецЕсли;
	рез = "";
	Если СОКРЛП(формула)<>"" Тогда
		УстановитьБезопасныйРежим(Истина);
		Выполнить(формула);
		УстановитьБезопасныйРежим(Ложь);
	КонецЕсли;
	Возврат рез;
КонецФункции


Функция ПолучитьСловаИсключивОпределение( ИсключитьСлово = Неопределено ) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
                   |    ИА_ОпределенияСклонения.Слово КАК Наименование
                   |ИЗ
                   |    Справочник.ИА_Определения.Склонения КАК ИА_ОпределенияСклонения
                   |ГДЕ
                   |    ИА_ОпределенияСклонения.Ссылка <> &Ссылка
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    ИА_ОпределенияСклонения.Слово
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    ИА_ОпределенияСклонения.Слово";
	Запрос.УстановитьПараметр("Ссылка", ИсключитьСлово);
	МассивСлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	сч=0;
	Пока сч < МассивСлов.Количество() Цикл
		МассивСлов[сч] = нрег(МассивСлов[сч]);
		сч = сч + 1;
	КонецЦикла;
	
	Возврат МассивСлов;
	
КонецФункции


Функция ПолучитьНастройкуПользователя(пНастройка, пПользователь = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = &Настройка";
	Запрос.УстановитьПараметр("Пользователь", ?(пПользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, пПользователь));
	Запрос.УстановитьПараметр("Настройка", пНастройка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции


функция ИА_ОбъектДоступен(Объект) Экспорт
	
	Набор = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Отбор.Пользователь.Использование = Истина;
	Набор.Отбор.ОбъектДоступа.Использование = Истина;
	
	//сначала праверяем есть ли у пользователя админские права
	Набор.Отбор.ОбъектДоступа.Значение = ПредопределенноеЗначение("Справочник.ОргСхема.ПустаяСсылка");
	Набор.Прочитать();
	
	Если Набор.Количество()>0 Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	//потом права конкретно на это объект
	Набор.Отбор.ОбъектДоступа.Значение = Объект;
	Набор.Прочитать();
	
	Возврат Набор.Количество()>0;
	
КонецФункции


Функция ВставитьСсылкиНаОпределения(НовТекст, ИсключитьСлово = Неопределено, Инструкция = Неопределено) экспорт
	
	МассивСлов = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьСловаИсключивОпределение(ИсключитьСлово);
    
	CтилиДляПодсказок = "
	|{
	|  color: #222;
	|  font-family: 'Lucida sans', Arial, Helvetica;
	|  width: 600px;
	|  margin: 50px auto;
	|  font-size: small;
	|  line-height: 1.4;
	|}
	|
	|.tooltip
	|{
	|  position: relative;
	|  background: #eaeaea;
	|  cursor: help;
	|  display: inline-block;
	|  text-decoration: none;
	|  color: #222;
	|  outline: none;
	|}
	|
	|.tooltip span
	|{
	|  visibility: hidden;
	|  position: absolute; 
	|  bottom: 30px;
	|  left: 50%;
	|  z-index: 999;
	|  width: 230px;
	|  margin-left: -127px;
	|  padding: 10px;
	|  border: 2px solid #ccc;
	|  opacity: .9;
	|  background-color: #ddd;                     
	|  background-image: -webkit-linear-gradient(rgba(255,255,255,.5), rgba(255,255,255,0));
	|  background-image: -moz-linear-gradient(rgba(255,255,255,.5), rgba(255,255,255,0));
	|  background-image: -ms-linear-gradient(rgba(255,255,255,.5), rgba(255,255,255,0));
	|  background-image: -o-linear-gradient(rgba(255,255,255,.5), rgba(255,255,255,0));
	|  background-image: linear-gradient(rgba(255,255,255,.5), rgba(255,255,255,0));  
	|  -moz-border-radius: 4px;
	|  border-radius: 4px;  
	|  -moz-box-shadow: 0 1px 2px rgba(0,0,0,.4), 0 1px 0 rgba(255,255,255,.5) inset;
	|  -webkit-box-shadow: 0 1px 2px rgba(0,0,0,.4), 0 1px 0 rgba(255,255,255,.5) inset;
	|  box-shadow: 0 1px 2px rgba(0,0,0,.4), 0 1px 0 rgba(255,255,255,.5) inset;  
	|  text-shadow: 0 1px 0 rgba(255,255,255,.4); 
	|}
	|
	|.tooltip:hover
	|{
	|  border: 0; /* IE6 fix */
	|}
	|
	|.tooltip:hover span
	|{
	|  visibility: visible;
	|}
	|
	|.tooltip span:before,
	|.tooltip span:after
	|{
	|  content: "";
	|  position: absolute;
	|  z-index: 1000;
	|  bottom: -7px;
	|  left: 50%;
	|  margin-left: -8px;  
	|  border-top: 8px solid #ddd;
	|  border-left: 8px solid transparent;
	|  border-right: 8px solid transparent;        
	|  border-bottom: 0;  
	|}
	|
	|.tooltip span:before
	|{
	|  border-top-color: #ccc;
	|  bottom: -8px;
	|}
	|";
	
	
    //{ ИА_Аврамов 05.02.2016
    // БЫЛО:
    ////НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
    ////НовыйHTMLДокумент.open("text/html");
    ////НовТекст = СтрЗаменить(НовТекст, "<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />", "");
    ////НовТекст = СтрЗаменить(НовТекст,"<STYLE>","<STYLE>"+CтилиДляПодсказок);
    ////НовыйHTMLДокумент.write(НовТекст);
    
    ////ПропарситьЧайлдовИВставитьОпределения(НовыйHTMLДокумент.all.tags("body").item(0).childNodes, МассивСлов);
    ////НовыйHTMLДокумент.close();
    ////
    ////НовТекст1 = НовыйHTMLДокумент.all.tags("html").item(0).outerHTML;
    ////НовТекст1 = СтрЗаменить(НовТекст1,"&lt;" ,"<");
    ////НовТекст1 = СтрЗаменить(НовТекст1,"&gt;" ,">");
    // СТАЛО:
    КлючХешаСтр = НовТекст + CтилиДляПодсказок + ИА_БФКС.Массив_Представление(МассивСлов);
    ДанныеКэша = ИА_БФС.КэшСтр_Получить(КлючХешаСтр);
    Если НЕ ДанныеКэша.Найдено Тогда
        НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
        НовыйHTMLДокумент.open("text/html");
        НовТекст = СтрЗаменить(НовТекст, "<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />", "");
        НовТекст = СтрЗаменить(НовТекст,"<STYLE>","<STYLE>"+CтилиДляПодсказок);
        НовыйHTMLДокумент.write(НовТекст);
        ПропарситьЧайлдовИВставитьОпределения(НовыйHTMLДокумент.all.tags("body").item(0).childNodes, МассивСлов);
        НовыйHTMLДокумент.close();
        НовТекст1 = НовыйHTMLДокумент.all.tags("html").item(0).outerHTML;
        НовТекст1 = СтрЗаменить(НовТекст1,"&lt;" ,"<");
        НовТекст1 = СтрЗаменить(НовТекст1,"&gt;" ,">");
        
        ИА_БФС.КэшСтр_Вставить(КлючХешаСтр, НовТекст1, Инструкция);
    Иначе
        НовТекст1 = ДанныеКэша.Значение;
    КонецЕсли; 
    //} 
	
	Возврат НовТекст1;
КонецФункции                                         

Процедура ПропарситьЧайлдовИВставитьОпределения(КоллекцияЧайлдов, МассивСлов)
	сч = 0;
    КоллекцияЧайлдовlength = КоллекцияЧайлдов.length;
    ////Для каждого эл Из КоллекцияЧайлдов Цикл
    Пока сч < КоллекцияЧайлдовlength Цикл
    	эл = КоллекцияЧайлдов.item(сч);
		Если ВРЕГ(эл.nodeName) = "A" Тогда
			сч = сч + 1;
			Продолжить;
		КонецЕсли;
		
		Если эл.nodeName = "#text" Тогда
			текстРазб = эл.nodeValue;
			
			сч_букв = 1;
			НачалоСлова = 0;
			КонецСлова = 0;
			
			Пока сч_букв <= СтрДлина(текстРазб) Цикл
				Слово = "";
				Символ = Сред(текстРазб, сч_букв, 1);
				
				Если ИА_ДИ_КлиентСервер.ЭтоБуква(Символ) Тогда
					НачалоСлова = сч_букв;
					Пока ИА_ДИ_КлиентСервер.ЭтоБуква(Символ) и сч_букв <= СтрДлина(текстРазб) Цикл
						Слово = Слово + Символ;
						КонецСлова = сч_букв;
						сч_букв = сч_букв + 1;
						Символ = Сред(текстРазб, сч_букв, 1);
					КонецЦикла;
					
					Если Слово<>"" Тогда
						Если МассивСлов.Найти(нрег(сокрЛП(Слово)))<>Неопределено Тогда
							
							Определение = ОпределениеПоСлову(Слово);							
							ТекстВсплывающейПодсказки = ПолучитьТекстИзHTML(Определение);
							ТекстВсплывающейПодсказки = СтрЗаменить(ТекстВсплывающейПодсказки,"""","");
							ТекстВсплывающейПодсказки = СтрЗаменить(ТекстВсплывающейПодсказки,Символы.ПС,"");
							
							текстРазб = Лев(текстРазб, НачалоСлова - 1) + "<A href=1CRefInstGlossary title = "+""""+ТекстВсплывающейПодсказки+""""+">"+ Слово + "</A>" + Сред(текстРазб, КонецСлова + 1);	
							сч_букв = сч_букв + СтрДлина("<A href=1CRefInstGlossary title = "+""""+ТекстВсплывающейПодсказки+""""+"></A>") - 1;
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				сч_букв = сч_букв + 1;
			КонецЦикла;
			
			эл.nodeValue = текстРазб;
		КонецЕсли;
		
		ПропарситьЧайлдовИВставитьОпределения(эл.childNodes, МассивСлов);
		сч = сч + 1;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТекстИзHTML(ТекстHTML) Экспорт
	
	фд = Новый ФорматированныйДокумент();
	вл = новый Структура();
	фд.УстановитьHTML(ТекстHTML, вл);
	рез = Строка(фд.ПолучитьФорматированнуюСтроку());
	
	Возврат рез;
КонецФункции

// Функция склоняет переданную фразу
// Параметры:
//  ФИО (обязательный), тип строка
//   Параметр должен содержать фамилию имя отчества в именительном падеже, которые необходимо просклонять.
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Результат (обязательный), тип строка
//   Переменная, в которую будет возвращен результат склонения.
//
//  Пол (необязательный), тип Перечисление.ПолФизическогоЛица
//   Пол физического лица
//
Функция Просклонять(Знач ФИО, Падеж, Результат, Пол = Неопределено) Экспорт
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклоненияФИО", "Decl");
	Компонента = Новый("AddIn.Decl.CNameDecl");
	
	Результат = ФИО;
	
	ИмяПеречисления = "ПолФизическихЛиц";
	
	Попытка
		Проверка = Перечисления.ПолФизическихЛиц.Мужской;
	Исключение
		ИмяПеречисления = "ПолФизическогоЛица";
	КонецПопытки;
	
	Попытка
		Если Пол = Перечисления[ИмяПеречисления].Мужской Тогда
			Результат = Компонента.Просклонять(Результат, Падеж, 1) + " ";
			
		ИначеЕсли Пол = Перечисления[ИмяПеречисления].Женский Тогда
			Результат = Компонента.Просклонять(Результат, Падеж, 2) + " ";
			
		Иначе
			Результат = Компонента.Просклонять(Результат, Падеж) + " ";
			
		КонецЕсли;
		
	Исключение
		Результат = ФИО;
		Возврат Ложь;
		
	КонецПопытки;
	
	Результат = СокрЛП(Результат);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДокФайла(пСсылка) Экспорт
	Возврат ИА_Защита_ДИ.ПолучитьДанныеДокФайла(пСсылка);
КонецФункции

Функция ПолучитьШаблон() Экспорт
	Возврат Константы.ИА_ДИ_ШаблонПодпись.Получить().Получить();
КонецФункции

Функция ПолучитьШаблонИнструкции() Экспорт
	Возврат Константы.ИА_ДИ_Шаблон.Получить().Получить();
КонецФункции

Функция ПолучитьДанныеПодписанта(Подписант) Экспорт
	Результат = Новый Структура("ФИО, Подпись, Должность");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ПодписиСотрудников.Должность,
	|	ИА_ПодписиСотрудников.ФИО,
	|	ИА_ПодписиСотрудников.Подпись
	|ИЗ
	|	РегистрСведений.ИА_ПодписиСотрудников КАК ИА_ПодписиСотрудников
	|ГДЕ
	|	ИА_ПодписиСотрудников.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Подписант);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат.ФИО = ВыборкаДетальныеЗаписи.ФИО;
		Результат.Должность = ВыборкаДетальныеЗаписи.Должность;
		Результат.Подпись = Base64Строка(ВыборкаДетальныеЗаписи.Подпись.Получить());
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат  Результат;
	
КонецФункции

Функция ПользователиБезПрав(СсылкаПост) Экспорт
	
	//Арчил Тваладзе 2016.04.25
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДанныеФизЛиц.ФизЛицо,
	               |	ИА_ДанныеФизЛиц.Пользователь
	               |ПОМЕСТИТЬ ВТФизЛицаПользователи
	               |ИЗ
	               |	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	               |ГДЕ
	               |	ИА_ДанныеФизЛиц.ФизЛицо В(&ФизЛицо)
	               |	И ИА_ДанныеФизЛиц.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	ИА_УровниДоступаПользователей.Пользователь КАК Пользователь1
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
	               |		ПО Пользователи.Ссылка = ИА_УровниДоступаПользователей.Пользователь
	               |			И (ИА_УровниДоступаПользователей.ОбъектДоступа = &ТекПост
	               |				ИЛИ ИА_УровниДоступаПользователей.ОбъектДоступа = ЗНАЧЕНИЕ(Справочник.ОргСхема.ПустаяСсылка))
	               |ГДЕ
	               |	Пользователи.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТФизЛицаПользователи.Пользователь
	               |			ИЗ
	               |				ВТФизЛицаПользователи)
	               |	И ИА_УровниДоступаПользователей.Пользователь ЕСТЬ NULL ";
				   
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаПост.Сотрудники.Выгрузить().ВыгрузитьКолонку("ФизЛицо"));
	Запрос.УстановитьПараметр("ТекПост", СсылкаПост);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	                                                      
	
	//Арчил Тваладзе 2016.04.25 старый механизм после проверки удалить
	
	//ИмяРеквизита ="ФизЛицо";
	//
	//Попытка
	//	ПустойПольз = Справочники.Пользователи.ПустаяСсылка();
	//	фл = ПустойПольз.ФизическоеЛицо;
	//	ИмяРеквизита = "ФизическоеЛицо";
	//Исключение
	//Конецпопытки;	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	Пользователи.Ссылка КАК Пользователь,
	//|	ИА_УровниДоступаПользователей.Пользователь КАК Пользователь1
	//|ИЗ
	//|	Справочник.Пользователи КАК Пользователи
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
	//|		ПО Пользователи.Ссылка = ИА_УровниДоступаПользователей.Пользователь
	//|			И (ИА_УровниДоступаПользователей.ОбъектДоступа = &ТекПост
	//|				ИЛИ ИА_УровниДоступаПользователей.ОбъектДоступа = ЗНАЧЕНИЕ(Справочник.ОргСхема.ПустаяСсылка))
	//|ГДЕ
	//|	Пользователи." + ИмяРеквизита + " В(&ФизЛицо)
	//|	И ИА_УровниДоступаПользователей.Пользователь ЕСТЬ NULL ";
	//Запрос.УстановитьПараметр("ФизЛицо", СсылкаПост.Сотрудники.Выгрузить().ВыгрузитьКолонку("ФизЛицо"));
	//Запрос.УстановитьПараметр("ТекПост", СсылкаПост);
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	//Конец Арчил Тваладзе
	
КонецФункции

Процедура УстановитьПраваПользователюНаДИПоста(СсылкаПост, Пользователи) Экспорт
	набор = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
	КодыРаспределения = новый Массив;
	КодыРаспределения.Добавить(СсылкаПост);
	
	Для каждого Пользователь из Пользователи Цикл 
		Набор.Отбор.Пользователь.Значение = Пользователь;
		Набор.Отбор.Пользователь.Использование = Истина;
		Набор.Прочитать();
		
		Новстр = Набор.Добавить();
		Новстр.Пользователь = Пользователь;
		Новстр.ОбъектДоступа = СсылкаПост;
		
		Набор.Записать();
		//
		ОбновитьДоступныеИнструкцииПользователя(Пользователь, КодыРаспределения);
	КонецЦикла;
КонецПроцедуры

Процедура УдалитьЛишниеПраваДИ(СсылкаПост) Экспорт
	
	//Арчил Тваладзе 2016.04.25
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ДанныеФизЛиц.ФизЛицо,
		|	ИА_ДанныеФизЛиц.Пользователь
		|ПОМЕСТИТЬ ВТФизЛицаПользователи
		|ИЗ
		|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		|ГДЕ
		|	ИА_ДанныеФизЛиц.ФизЛицо В(&ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИА_УровниДоступаПользователей.Пользователь,
		|	ИА_УровниДоступаПользователей.ОбъектДоступа
		|ПОМЕСТИТЬ ВТУровниДоступаПользователей
		|ИЗ
		|	РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|ГДЕ
		|	ИА_УровниДоступаПользователей.ОбъектДоступа = &ОбъектДоступа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУровниДоступаПользователей.Пользователь,
		|	ВТФизЛицаПользователи.Пользователь КАК Пользователь1,
		|	ВТФизЛицаПользователи.ФизЛицо
		|ИЗ
		|	ВТУровниДоступаПользователей КАК ВТУровниДоступаПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаПользователи КАК ВТФизЛицаПользователи
		|		ПО ВТУровниДоступаПользователей.Пользователь = ВТФизЛицаПользователи.Пользователь
		|ГДЕ
		|	ВТФизЛицаПользователи.Пользователь ЕСТЬ NULL ";
		
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаПост.Сотрудники.Выгрузить().ВыгрузитьКолонку("ФизЛицо"));
	Запрос.УстановитьПараметр("ОбъектДоступа", СсылкаПост);

	РезультатЗапроса = Запрос.Выполнить();
	
	
	МассивФизЛицКУдалению = Новый Массив;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивФизЛицКУдалению.Добавить(ВыборкаДетальныеЗаписи.Пользователь);

	КонецЦикла;
	
	ПользователиПересчитать = Новый Массив;
	
	НаборЗаписей = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектДоступа.Значение = СсылкаПост;
	НаборЗаписей.Отбор.ОбъектДоступа.Использование = Истина;
	НаборЗаписей.Прочитать();
	
	Счет = НаборЗаписей.Количество()-1;
	
	Пока Счет >= 0 Цикл 
		
		ЗаписьНабора = НаборЗаписей[Счет];
		ПользовательКУдалению = ЗаписьНабора.Пользователь;
		
		Если МассивФизЛицКУдалению.Найти(ПользовательКУдалению) <> Неопределено Тогда
			
			ПользователиПересчитать.Добавить(ПользовательКУдалению);
			НаборЗаписей.Удалить(Счет);
			
		КонецЕсли;
		
		Счет = Счет -1;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	// переопределим доступные инструкции для удаленных юзеров
	Коды = Новый Массив;
	Коды.Добавить(СсылкаПост);
	
	Для каждого Пользователь из ПользователиПересчитать Цикл
		ОбновитьДоступныеИнструкцииПользователя(Пользователь, Коды);
	КонецЦикла;
	
	// 	ИмяРеквизита ="ФизЛицо";
	//
	//Попытка
	//	ПустойПольз = Справочники.Пользователи.ПустаяСсылка();
	//	фл = ПустойПольз.ФизическоеЛицо;
	//	ИмяРеквизита = "ФизическоеЛицо";
	//Исключение
	//Конецпопытки;
	//
	//МассивФЛ = Новый Массив;
	//для каждого стрФЛ из СсылкаПост.Сотрудники Цикл
	//	МассивФЛ.Добавить(стрФЛ.ФизЛицо);
	//КонецЦикла;
	//
	//набор = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
	//Набор.Отбор.ОбъектДоступа.Значение = СсылкаПост;
	//Набор.Отбор.ОбъектДоступа.Использование = Истина;
	//Набор.Прочитать();
	//
	//сч = Набор.Количество()-1;
	//ПользователиПересчитать = Новый Массив;
	//
	//Пока сч >= 0 Цикл 
	//	стрПраво = набор[сч];
	//	Если МассивФЛ.Найти(стрПраво.Пользователь[ИмяРеквизита]) = Неопределено Тогда
	//		Набор.Удалить(сч);
	//		ПользователиПересчитать.Добавить(стрПраво.Пользователь);
	//	КонецЕсли;
	//	сч = сч -1;
	//КонецЦикла;
	//
	//Набор.Записать();
	//
	//// переопределим доступные инструкции для удаленных юзеров
	//Коды = Новый Массив;
	//Коды.Добавить(СсылкаПост);
	//Для каждого польз из ПользователиПересчитать Цикл
	//	ОбновитьДоступныеИнструкцииПользователя(польз, Коды);
	//КонецЦикла;
	
	//Конец Арчил Тваладзе

КонецПроцедуры

Процедура ОбновитьДоступныеИнструкцииПользователя(Пользователь, КодыРаспределения, Администратор=Ложь) Экспорт
	// Обновление доступных инструкций
	Набор = РегистрыСведений.ИА_ДоступныеИнструкции.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Значение = Пользователь;
	Набор.Отбор.Пользователь.Использование = Истина;
	Если Администратор Тогда // все инструкции
		ВыборкаИнстр = Справочники.ИА_Инструкции.Выбрать();
		Пока ВыборкаИнстр.Следующий() Цикл
			Новстр = Набор.Добавить();
			Новстр.Инструкция = ВыборкаИнстр.Ссылка;
			Новстр.Пользователь = Пользователь;
		КонецЦикла;
	Иначе
		СписокРодителей = Новый СписокЗначений;
		Для каждого КодРаспределения ИЗ КодыРаспределения Цикл
			ТекРодитель = КодРаспределения.Родитель;
			Пока ЗначениеЗаполнено(ТекРодитель) Цикл
				Если СписокРодителей.НайтиПоЗначению(ТекРодитель)=Неопределено Тогда
					СписокРодителей.Добавить(ТекРодитель);
				КонецЕсли;
				ТекРодитель = ТекРодитель.Родитель;
			КонецЦикла;
		КонецЦикла;
		
		ЕстьКонтрольПоТипамИнструкций = Константы.ИА_ДИ_КонтрольПоТипамИнструкций.Получить();
		ЕстьКонтрольПоСтатусам        = Константы.ИА_ДИ_КонтрольПоСтатусам.Получить();
		ЕстьКонтрольПоСериям          = Константы.ИА_ДИ_КонтрольПоСериям.Получить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИА_Инструкции.Ссылка
		|ИЗ
		|	Справочник.ИА_Инструкции КАК ИА_Инструкции ";
		Если ЕстьКонтрольПоТипамИнструкций Тогда
			Запрос.Текст = Запрос.Текст + "
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей1
			|		ПО (ИА_Инструкции.ТипИнструкции = ИА_УровниДоступаПользователей1.ОбъектДоступа
			|					И ИА_УровниДоступаПользователей1.Пользователь = &Пользователь
			|				ИЛИ ИА_Инструкции.ТипИнструкции = &ПустойТип) ";
		КонецЕсли;
		Если ЕстьКонтрольПоСтатусам Тогда
			Запрос.Текст = Запрос.Текст + "
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей3
			|		ПО (ИА_Инструкции.Статус = ИА_УровниДоступаПользователей3.ОбъектДоступа
			|					И ИА_УровниДоступаПользователей3.Пользователь = &Пользователь
			|				ИЛИ ИА_Инструкции.Статус = &ПустойСтатус) ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ИнструкцииПоКодам.Ссылка КАК Ссылка
		|		ИЗ
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ИА_Инструкции.Ссылка КАК Ссылка,
		|				ИА_ИнструкцииКодыРаспределения.КодРаспределения КАК КодРаспределения,
		|				ИА_ИнструкцииКодыРаспределения.ВсемСотрудникам КАК ВсемСотрудникам
		|			ИЗ
		|				Справочник.ИА_Инструкции КАК ИА_Инструкции
		|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_Инструкции.КодыРаспределения КАК ИА_ИнструкцииКодыРаспределения
		|					ПО ИА_Инструкции.Ссылка = ИА_ИнструкцииКодыРаспределения.Ссылка) КАК ИнструкцииПоКодам
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей4
		|				ПО ((ИнструкцииПоКодам.КодРаспределения = ИА_УровниДоступаПользователей4.ОбъектДоступа
		|							ИЛИ ИнструкцииПоКодам.КодРаспределения В (&СписокРодителей)
		|								И ИнструкцииПоКодам.ВсемСотрудникам)
		|							И ИА_УровниДоступаПользователей4.Пользователь = &Пользователь
		|						ИЛИ ИнструкцииПоКодам.КодРаспределения ЕСТЬ NULL )) КАК ИнструкцииПоКодам
		|		ПО ИА_Инструкции.Ссылка = ИнструкцииПоКодам.Ссылка ";
		
		Если ЕстьКонтрольПоСтатусам Тогда
			Запрос.Текст = Запрос.Текст + "
			
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ИнструкцииПоСериям.Ссылка КАК Ссылка
			|		ИЗ
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ИА_Инструкции.Ссылка КАК Ссылка,
			|				ИА_ИнструкцииСерии.Серия КАК Серия
			|			ИЗ
			|				Справочник.ИА_Инструкции КАК ИА_Инструкции
			|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИА_Инструкции.Серии КАК ИА_ИнструкцииСерии
			|					ПО ИА_Инструкции.Ссылка = ИА_ИнструкцииСерии.Ссылка) КАК ИнструкцииПоСериям
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей5
			|				ПО (ИнструкцииПоСериям.Серия = ИА_УровниДоступаПользователей5.ОбъектДоступа
			|							И ИА_УровниДоступаПользователей5.Пользователь = &Пользователь
			|						ИЛИ ИнструкцииПоСериям.Серия ЕСТЬ NULL )) КАК ПоСериям
			|		ПО ИА_Инструкции.Ссылка = ПоСериям.Ссылка";
		КонецЕсли;
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("ПустойТип", Справочники.ИА_ТипыИнструкций.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПустойСтатус", Перечисления.ИА_СтатусИнструкции.ПустаяСсылка());
		Запрос.УстановитьПараметр("СписокРодителей", СписокРодителей);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока выборка.Следующий() Цикл
			Новстр = Набор.Добавить();
			Новстр.Инструкция = выборка.Ссылка;
			Новстр.Пользователь = Пользователь;
		КонецЦикла;
	КонецЕсли;
	Набор.Записать(Истина);
КонецПроцедуры

Функция ПолучитьПредставлениеИнструкции(Инструкция) Экспорт
    Текст = Инструкция.Текст;
    
    НовТекст = ИА_ДИ_КлиентСервер.ПропарситьХТМЛДокументИОбновитьНаименованияСсылокИПеременные(Текст, Инструкция);
    НовТекст = ВставитьСсылкиНаОпределения(НовТекст,,Инструкция);
    
    Возврат НовТекст;
КонецФункции
 
Процедура ПроверитьПраваПоста(СсылкаПост) Экспорт
	Пользователи1 = ПользователиБезПрав(СсылкаПост);
	Если Пользователи1.Количество()>0 Тогда
		УстановитьПраваПользователюНаДИПоста(СсылкаПост,Пользователи1);		
	КонецЕсли;
КонецПроцедуры

Процедура ВывестиПодписьИПечать(Подписант, ДД_Инструкции, ИмяФайлаДок,ДвДанныеШаблон) Экспорт
			
	ДанныеПодписи = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеПодписанта(Подписант);
	Если ДанныеПодписи = Неопределено Тогда
		Сообщить("У подписанта не настроена подпись. Укажите в настройках КСУ.");
		Возврат;
	КонецЕсли;
	
	редактор = ПолучитьРедакторИнструкций();
	Если редактор = Неопределено Тогда // гугл. Там еще подписи не делали
		возврат;
	КонецЕсли;
	
	Если редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.ПустаяСсылка") Тогда
		Сообщить("Установите MS Word или Open Office Writer");
		Возврат;
	КонецЕсли;
	
	ВрКат = КаталогВременныхФайлов()+"ksu_template\";
	СоздатьКаталог(ВрКат);
	ПолныйПутьДокФайлШаблон = ВрКат + "template.doc";
	ДвДанныеШаблон.Записать(ПолныйПутьДокФайлШаблон);
	
	пИмяФайла = ВрКат + ИмяФайлаДок;
	ДД_Инструкции.Записать(пИмяФайла);
	
	файлДок = Новый Файл(пИмяФайла);
	ПолныйПутьКартинкаПодпись = файлДок.Путь + "signature.jpg";
	Если ДанныеПодписи.Подпись <> "" Тогда
		ДвДанныеПодпись = Base64Значение(ДанныеПодписи.Подпись);
		ДвДанныеПодпись.Записать(ПолныйПутьКартинкаПодпись);
	КонецЕсли;
	
	Если редактор = ПредопределенноеЗначение("Перечисление.ИА_РедакторИнструкций.Word") Тогда
		Word = новый COMОбъект("Word.Application");
		Document = Word.Documents.Open(ПолныйПутьДокФайлШаблон);
		//
		// Производим замену (подготовка шаблона)
		//
		Поиск = Document.Range().Find; 
		Поиск.ClearFormatting(); 
		Поиск.Execute("%ДОЛЖНОСТЬ%", , , , , , - 1, , , ДанныеПодписи.Должность, 2);
		Поиск.Execute("%ФИО%", , , , , , - 1, , , ДанныеПодписи.ФИО, 2);
		//
		// вставляем подпись
		//
		Для Каждого s из Document.Shapes Цикл
			Если s.Type = 13 Тогда
				прервать;
			КонецЕсли;
		КонецЦикла;
		Document.Shapes.AddPicture(ПолныйПутьКартинкаПодпись, false, true, 0, 0, s.Width, s.Height, s.Anchor); 
		s.Delete();
		
		Document.Save();		
		Document.Close();
		
		//
		//загрузка основного документа
		//
		Document = Word.Documents.Open(пИмяФайла);
		Selection = Word.Selection;
		
		//
		//переход в конец документа
		//
		wdStory = 6;
		Selection.EndKey(wdStory);
		
		//
		// вставка из документа
		//
		Selection.InsertFile(ПолныйПутьДокФайлШаблон, "",False, False, False);
		
		//
		// сохраняем, закрываем
		//
		Document.Save();		
		Document.Close();
		
		Word.Quit();
		Word = 0;
	Иначе // ОО
		Word = новый COMОбъект("com.sun.star.ServiceManager");
		Desktop = Word.createInstance("com.sun.star.frame.Desktop");
		
		Args = Новый COMSafeArray("VT_VARIANT", 1);
		// невидимым нельзя сделать ОО глючит
		//lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
		//lProp.Name  = "Hidden"; 
		//lProp.Value = true; 
		//Args.SetValue(0, lProp);
		
		lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
		lProp.Name  = "MacroExecutionMode"; 
		lProp.Value = 2; 
		Args.SetValue(0, lProp);
		
		//
		// вставляем подпись (подготовка шаблона)
		//
		Если ДанныеПодписи.Подпись <> "" Тогда
			ДокументШаблон = Desktop.LoadComponentFromURL(convertToURL(ПолныйПутьДокФайлШаблон), "_hidden", 0, Args);
			oExistingGraph = ДокументШаблон.getGraphicObjects().getbyIndex(0);
			oExistingGraph.GraphicURL = convertToURL(ПолныйПутьКартинкаПодпись);
			
			ДокументШаблон.store();
			ДокументШаблон.Close(Истина);
			ДокументШаблон = 0;
		КонецЕсли;
		
		//
		//загрузка основного документа
		//
		Документ = Desktop.LoadComponentFromURL(convertToURL(пИмяФайла), "_hidden", 0, Args);
		dispatcher = Word.createInstance("com.sun.star.frame.DispatchHelper");
		documentFrame = Документ.CurrentController.Frame;
		
		//
		//переход в конец документа
		//
		lProperties1 = Новый COMSafeArray("VT_VARIANT", 0);
		dispatcher.executeDispatch(documentFrame, ".uno:GoToEndOfDoc", "", 0, lProperties1);
		
		//
		// вставка из документа
		//
		lProperties = Новый COMSafeArray("VT_VARIANT", 2);
		lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
		lProp.Name  = "Name"; 
		lProp.Value = convertToURL(ПолныйПутьДокФайлШаблон); 
		lProperties.SetValue(0, lProp);
		
		lProp2       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
		lProp2.Name  = "Filter"; 
		lProp2.Value = "MS Word 97"; 
		lProperties.SetValue(1, lProp2);
		
		dispatcher.executeDispatch(documentFrame, ".uno:InsertDoc", "", 0, lProperties);
		
		//
		// Производим замену
		//
		lProperties = ПолучитьСвойстваЗаменыТекста(Word, "%ДОЛЖНОСТЬ%", ДанныеПодписи.Должность); 
		dispatcher.executeDispatch(documentFrame, ".uno:ExecuteSearch", "", 0, lProperties);
		lProperties = ПолучитьСвойстваЗаменыТекста(Word, "%ФИО%", ДанныеПодписи.ФИО); 
		dispatcher.executeDispatch(documentFrame, ".uno:ExecuteSearch", "", 0, lProperties);
		
		//
		// убираем последний разрыв страницы
		//
		iCnt = 0;
		iCnt1 = 0;
		oText = Документ.Text;
		oCursor = oText.CreateTextCursor();
		oCursor.GoToStart(False);
		Продолжать = истина;
		Пока Продолжать Цикл // получим количество разрывов
			Если не oCursor.gotoEndOfParagraph(True) Тогда Прервать; КонецЕсли;
			Если ЗначениеЗаполнено(oCursor.PageDescName) Тогда
				iCnt = iCnt + 1;
			КонецЕсли;
			Продолжать = oCursor.gotoNextParagraph(False);
		КонецЦикла;
		
		oCursor.GoToStart(False);  
		Продолжать = истина;
		Пока Продолжать Цикл // удалим последний разрыв
			Если не oCursor.gotoEndOfParagraph(True) Тогда Прервать; КонецЕсли;
			Если ЗначениеЗаполнено(oCursor.PageDescName) Тогда
				iCnt1 = iCnt1 + 1;
				Если iCnt1 = iCnt Тогда
					oCursor.PageDescName = "";
				КонецЕсли;
			КонецЕсли;
			Продолжать = oCursor.gotoNextParagraph(False);
		КонецЦикла;			
		
		//
		// сохраняем, закрываем
		//
		Документ.store();
		Документ.Close(Истина);
		//
		Документ = 0;
		Args = 0;
		lProperties = 0;
		lProp = 0;
		Desktop = 0;
		Word = 0;
	КонецЕсли;
	
	ДД_Инструкции = Новый ДвоичныеДанные(пИмяФайла);
	УдалитьФайлы(ВрКат);

КонецПроцедуры

Функция ПолучитьСвойстваЗаменыТекста(Word, ЧтоМеняем, НаЧтоменяем)
	lProperties = Новый COMSafeArray("VT_VARIANT", 6);
	
	lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
	lProp.Name  = "SearchItem.SearchFlags"; 
	lProp.Value = 65536; 
	lProperties.SetValue(0, lProp);
	
	lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
	lProp.Name  = "SearchItem.SearchString"; 
	lProp.Value = ЧтоМеняем; 
	lProperties.SetValue(1, lProp);
	
	lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
	lProp.Name  = "SearchItem.ReplaceString"; 
	lProp.Value = НаЧтоменяем; 
	lProperties.SetValue(2, lProp);
	
	lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
	lProp.Name  = "SearchItem.Command"; 
	lProp.Value = 3; 
	lProperties.SetValue(3, lProp);
	
	lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
	lProp.Name  = "Quiet"; 
	lProp.Value = true; 
	lProperties.SetValue(4, lProp);
	
	lProp       = Word.Bridge_GetStruct("com.sun.star.beans.PropertyValue"); 
	lProp.Name  = "SearchItem.AlgorithmType"; 
	lProp.Value = 0; 
	lProperties.SetValue(5, lProp);
	
	
	Возврат lProperties;
КонецФункции

функция convertToURL(FileName) Экспорт
    рез =  стрзаменить(FileName," ","%20" );
    рез =  стрзаменить(рез,"\","/" );
    возврат "file:/" + "/localhost/"+рез;
конецфункции

Функция ПолучитьРедакторИнструкций() Экспорт
	
	Если Константы.ИА_ДИ_ИспользоватьGoogleДокументы.Получить() или Константы.ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации.Получить() Тогда
		возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Word = новый COMОбъект("Word.Application");
		Word = 0;
		Возврат Перечисления.ИА_РедакторИнструкций.Word;
	Исключение
	КонецПопытки;
	
	Попытка
		Word = новый COMОбъект("com.sun.star.ServiceManager");
		Word = 0;
		Возврат Перечисления.ИА_РедакторИнструкций.Writer;
	Исключение
	КонецПопытки;
	
	Возврат Перечисления.ИА_РедакторИнструкций.ПустаяСсылка();
КонецФункции

Функция ПолучитьДанныеОпределения(Инструкция) Экспорт
	
	ТекстОпр = Инструкция.Определение;
	
	Вложения = Инструкция.Вложения.Получить();
	Если Вложения<>Неопределено Тогда
		Для каждого стр из Вложения Цикл
			Если ТипЗнч(стр.Значение) = Тип("Картинка") Тогда
				имяФ = стр.Ключ;
				ддФ = стр.Значение.ПолучитьДвоичныеДанные();
				
				КартинкаBase64 = Base64Строка(ддФ);
				ТекстОпр = СтрЗаменить(ТекстОпр,"src="""+имяФ, "src=""data:image/jpeg;base64,"+КартинкаBase64);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекстОпр;
КонецФункции

Функция ПолучитьЗадачуНаОзнакомление(Сотрудник, СписокДИ, срок) Экспорт
	Док = Документы.ИА_ЗаданиеНаИзучениеДИ.СоздатьДокумент();
	док.Дата = ТекущаяДата();
	док.Автор = ПараметрыСеанса.ТекущийПользователь;
	док.Сотрудник = Сотрудник;
	док.Срок = срок;
	
	Для каждого стрДИ из СписокДИ Цикл
		НовстрДИ = док.Инструкции.Добавить();
		НовстрДИ.Инструкция = стрДИ;
		НовстрДИ.УИДстроки = строка(новый УникальныйИдентификатор);
		
		Для каждого стрВопрос из стрДИ.Вопросы Цикл
			новстрВопрос = док.Вопросы.Добавить();
			новстрВопрос.Вопрос = стрВопрос.Вопрос;
			новстрВопрос.УИДстроки = НовстрДИ.УИДстроки;
		КонецЦикла;
	КонецЦикла;
	
	док.Записать(РежимЗаписиДокумента.Проведение);
	
	возврат док.Ссылка;
КонецФункции
